:PROPERTIES:
:mtime:    20230212122058
:END:
#+PROPERTY: header-args :tangle (print ps/file-karabiner-edn)
#+TITLE:Pablo's Karabiner config
#+AUTHOR: Pablo Stafforini <pablo@stafforini.com>
#+filetags: :project:
:PROPERTIES:
:TOC:      ignore
:ARCH:      ignore
:END:

* Introduction
:PROPERTIES:
:ID:       F8A496BC-A40E-4362-B36B-9B7941844ACC
:END:
:LOGBOOK:
CLOCK: [2022-07-01 Fri 11:06]--[2022-07-01 Fri 11:24] =>  0:18
CLOCK: [2021-02-28 Sun 19:56]--[2021-02-28 Sun 20:00] =>  0:04
:END:

** Key associations
:PROPERTIES:
:ID:       B12E6A52-5176-4484-B44B-137310DCFB6C
:END:
:LOGBOOK:
CLOCK: [2021-06-07 Mon 20:38]--[2021-06-07 Mon 21:52] =>  1:14
:END:

|   |                                              |
|---+----------------------------------------------|
| C | left_command                                 |
| T | left_control                                 |
| O | left_option                                  |
| S | left_shift                                   |
| F | fn                                           |
| Q | right_command                                |
| W | right_control                                |
| E | right_option                                 |
| R | right_shift                                  |
| P | caps_lock                                    |
| ! | command + control + optional + shift (hyper) |
|   |                                              |

| physical key        | k-alone         | e-alone         | karabiner | Emacs     | Emacs function              |
|---------------------+-----------------+-----------------+-----------+-----------+-----------------------------|
| [[id:7A4C371E-862F-4F1D-80D9-4E33869AEDE7][equal_sign]]          | =               | =               | SO        | A         |                             |
| [[id:20033DF1-9596-4257-8C3C-8A90BE97B221][caps_lock]]           | escape          | C-g             | O         | M         |                             |
| [[id:CF0E3547-DE12-40CE-8BBB-4347FFEE7401][left_shift]]          | -               | -               | QO        | A-M       |                             |
| [[id:E5FED8CC-8FA4-4964-87EF-4801A2B91848][left_control]]        | Ctab            |                 | QC        | A-H       |                             |
| [[id:CC3880F6-F71B-492D-8F0E-585ADB552004][delete_or_backspace]] | return_or_enter | return_or_enter | C         | H         |                             |
| delete_forward      | TC0             | C-H-0           | S         | S         |                             |
| [[id:D9295C31-3375-4F78-974C-9EDDEFA6E8A3][tab]]                 | tab             | tab             | T         | C         |                             |
| [[id:30827877-0622-4450-A217-56C7A05CC20F][right_control]]       | f18             | f18             | QT        | A-C       |                             |
| [[id:18FD5116-6D73-4B5D-9379-A0DD1D01970F][right_shift]]         | –               | –               | QW        | A-s       | major mode                  |
| [[id:D14C4590-0118-47A1-8095-E7A18EC694C0][quote]]               | '               | '               | [TBD]     | s         | major mode                  |
| [[id:18AA9398-C7DA-4FA2-BC6A-E8C0382D75C5][backslash]]           | \               | [diacritic]     | [TBD]     | H-s       | diacritics                  |
| [[id:4E6E7538-0296-485F-BFB0-DF1316DC32E2][comma]]               |                 |                 | QCO       | A-H-M     | transposition               |
| [[id:6D08B8C7-EE4C-42E0-928D-6ED3F05B7005][period]]              |                 |                 | QCT       | A-H-C     | delete/copy whole element   |
| [[id:87BE8B2A-1F3C-48C7-99D9-36A6D00F7399][slash]]               |                 |                 | COW       | H-M-s     | files/buffers               |
| [[id:0901DE3D-511F-4547-ACCD-3AAD9703DAAD][j]]                   |                 |                 | QTC       | A-C-H     | deletion                    |
| [[id:C1FE60BD-9863-4E45-93F7-3E23DC589DDA][l]]                   |                 |                 | TCOW      | C-H-M-s   | org movement/manipulation   |
| [[id:8C32B75E-1455-444F-B5F6-83DC8263D558][p]]                   |                 |                 | TOW       | C-M-s     | media/mouse control         |
| [[id:A670C98B-FCD0-4B4C-A3D9-C0DB143209AE][x]]                   |                 |                 | TCW       | C-H-s     | avy                         |
| [[id:303127EC-3362-408C-9A3B-45C2A108D994][z]]                   |                 |                 | QTW       | A-C-s     | movement                    |
| [[id:5BA69509-7C1B-4DD6-A54D-112902320CCB][semicolon]]           | ;               | ;               |           |           | special characters          |
|                     |                 |                 | QCOW      | A-H-M-s   | resvd. for misc. remappings |
|---------------------+-----------------+-----------------+-----------+-----------+-----------------------------|
|                     |                 |                 | TO        | C-M       |                             |
|                     |                 |                 | TW        | C-s       |                             |
|                     |                 |                 | CO        | H-M       |                             |
| [[id:7898DDC0-CE2C-45A7-A418-A75CEFA743AC][Cj]]                  |                 |                 | TCOWQ     | A-C-H-M-s | copy                        |
|                     |                 |                 | TCO       | C-H-M     |                             |
|                     |                 |                 | COW       | H-M-s     |                             |
| [[id:DAEB0BD5-535B-42E1-9170-C1039B8EC794][CSj]]                 |                 |                 | QTCO      | A-C-H-M   | delete                      |
|                     |                 |                 | WTQO      | A-C-M-s   |                             |
|                     |                 |                 | QTCW      | A-C-H-s   |                             |
|                     |                 |                 |           |           |                             |

* Profiles
:PROPERTIES:
:ID:       B42AA5C9-7EB9-415A-ACFE-BBB532055EFE
:END:
:LOGBOOK:
CLOCK: [2021-07-21 Wed 11:07]--[2021-07-21 Wed 11:30] =>  0:23
CLOCK: [2021-03-19 Fri 19:11]--[2021-03-19 Fri 20:01] =>  0:50
CLOCK: [2021-03-19 Fri 13:13]--[2021-03-19 Fri 13:17] =>  0:04
CLOCK: [2021-03-19 Fri 12:47]--[2021-03-19 Fri 13:10] =>  0:23
:END:

It seems that there is no way to set the relevant delay for a simlayer, so the only alternative is to recreate the ~spacebar~ simlayer functionality as a series of individual modifications. Then the delay would, I believe, be controlled by the ~sim~ variable (since ~spacebar~ + each of the keys it currently modifies in the simlayer would be considered simultaneous key presses).

#+begin_src clojure
{
:profiles {
           :Default {:default true
#+end_src

** alone
:PROPERTIES:
:ID:       79309E80-010E-4979-871B-250DC69E83F6
:END:
:LOGBOOK:
CLOCK: [2021-03-19 Fri 20:35]--[2021-03-19 Fri 21:45] =>  1:10
:END:
[[https://karabiner-elements.pqrs.org/docs/json/complex-modifications-manipulator-definition/to-if-alone/][alone]] (~to_if_alone_timeout_miliseconds~): if a key is held for at least this long, it will not trigger its alone mapping when released.

Example:

#+begin_src clojure :tangle no
{:des "caps -> escape (alone) left_option (held)"
 :rules [
         [:##caps_lock :left_option nil {:alone :escape}]
         ]}
#+end_src

If ~caps_lock~ is held for at least 100 miliseconds, it will not trigger ~escape~.

#+begin_src clojure
:alone   200
#+end_src

** sim
:PROPERTIES:
:ID:       2385C6F9-C9AD-4613-B9C0-E67C4D99CF2F
:END:
:LOGBOOK:
CLOCK: [2021-07-16 Fri 21:54]--[2021-07-16 Fri 22:04] =>  0:10
:END:

[[https://karabiner-elements.pqrs.org/docs/json/complex-modifications-manipulator-definition/from/simultaneous/][sim]] (~simultaneous_threshold_miliseconds~): keys need to be pressed within these many miliseconds to be considered simultaneous. This doesn't apply to modifier keys, but to "normal" keys (e.g. ~q~ + ~k~ to launch karabiner).

#+begin_src clojure
:sim   200
#+end_src
* Layers
:PROPERTIES:
:ID:       369A7942-816B-433F-92F7-46EA80BC1CEB
:mtime:    20230212115726
:ctime:    20230212115726
:END:
:LOGBOOK:
CLOCK: [2022-06-07 Tue 14:51]--[2022-06-07 Tue 15:24] =>  0:33
CLOCK: [2021-07-23 Fri 09:42]--[2021-07-23 Fri 10:00] =>  0:18
CLOCK: [2021-07-23 Fri 08:40]--[2021-07-23 Fri 09:27] =>  0:47
CLOCK: [2021-07-14 Wed 12:10]--[2021-07-14 Wed 12:49] =>  0:39
CLOCK: [2021-07-13 Tue 09:00]--[2021-07-13 Tue 09:19] =>  0:19
CLOCK: [2021-06-15 Tue 19:28]--[2021-06-15 Tue 19:40] =>  0:12
CLOCK: [2021-03-20 Sat 21:48]--[2021-03-20 Sat 21:56] =>  0:08
:END:

#+begin_src clojure
:layers {
         :quote-mode {:key :quote :condi :chrome} ; site-specific macros (Chrome)
         }
#+end_src

#+begin_src clojure
:simlayers {
            :launch_mode {:key :f24}
            :j-mode {:key :j} ; killing
            :l-mode {:key :l} ; org headings
            :p-mode {:key :p} ; media/mouse
            :q-mode {:key :q} ; apps
            :x-mode {:key :x} ; avy
            :z-mode {:key :z} ; movement
            :comma-mode {:key :comma} ; transposition
            :period-mode {:key :period} ; buffers
            :semicolon-mode {:key :semicolon} ; numbers and symbols
            :slash-mode {:key :slash} ; files (Emacs) | app-specific macros (outside Emacs)
            }
#+end_src

*** DONE Find way to eliminate accidental triggers
CLOSED: [2021-07-16 Fri 21:27]
:PROPERTIES:
:ARCHIVE_TIME: 2021-07-16 Fri 21:27
:ID:       D60985A7-AE5E-4565-B862-7641318071E4
:END:
:STATES:
- Not scheduled, was "[2021-07-16 Fri]" on [2021-07-16 Fri 21:27]
:END:
:LOGBOOK:
CLOCK: [2021-07-16 Fri 20:05]--[2021-07-16 Fri 21:14] =>  1:09
:END:

** Letter frequencies
:PROPERTIES:
:ID:       0EAAC3EF-7D66-4CF5-ABF0-D561430D7B98
:mtime:    20230212122058
:ctime:    20230212122058
:END:
:LOGBOOK:
CLOCK: [2021-07-16 Fri 15:50]--[2021-07-16 Fri 16:52] =>  1:02
:END:

Source: [[https://en.wikipedia.org/wiki/Letter_frequency][Wikipedia]]

| letter |    freq | normalized | used |
|--------+---------+------------+------|
| E      | 0.13000 |         1. |      |
| T      | 0.09100 |  1.4285714 |      |
| A      | 0.08200 |  1.5853659 |      |
| O      | 0.07500 |  1.7333333 |      |
| I      | 0.07000 |  1.8571429 |      |
| N      | 0.06700 |  1.9402985 |      |
| S      | 0.06300 |  2.0634921 |      |
| H      | 0.06100 |  2.1311475 |      |
| R      | 0.06000 |  2.1666667 |      |
| D      | 0.04300 |  3.0232558 |      |
| L      | 0.04000 |       3.25 |      |
| C      | 0.02800 |  4.6428571 |      |
| U      | 0.02800 |  4.6428571 |      |
| M      | 0.02400 |  5.4166667 |      |
| W      | 0.02400 |  5.4166667 |      |
| F      | 0.02200 |  5.9090909 |      |
| G      | 0.02000 |        6.5 |      |
| Y      | 0.02000 |        6.5 |      |
| [[id:8C32B75E-1455-444F-B5F6-83DC8263D558][P]]      | 0.01900 |  6.8421053 | t    |
| B      | 0.01500 |  8.6666667 |      |
| V      | 0.00980 |  13.265306 |      |
| K      | 0.00770 |  16.883117 |      |
| [[id:0901DE3D-511F-4547-ACCD-3AAD9703DAAD][J]]      | 0.00150 |  86.666667 | t    |
| [[id:A670C98B-FCD0-4B4C-A3D9-C0DB143209AE][X]]      | 0.00150 |  86.666667 | t    |
| Q      | 0.00095 |  136.84211 | t    |
| Z      | 0.00074 |  175.67568 | t    |
#+TBLFM: $3=@2$2/$2


